In [1]:
import pandas as pd
from sqlalchemy import create_engine
import pymysql
pymysql.install_as_MySQLdb()

## Connect to local Database

In [4]:
engine = create_engine("mysql://root:aRobertw94@localhost/wine_db")

## Check for tables

In [5]:
engine.table_names()

['humid_data', 'rain_data', 'sun_data', 'temp_data', 'wine_data']

## Read in Humidity csv

In [6]:
csv_file = "../Raw_Data/state_humid.csv"
state_humid_df = pd.read_csv(csv_file)
state_humid_df.head()

        state  morning_humidity  afternoon_humidity
0     Alabama                84                  52
1      Alaska                77                  64
2     Arizona                53                  25
3    Arkansas                85                  49
4  California                76                  62

## Use pandas to load csv converted DataFrame into database - Humidity

In [7]:
state_humid_df.to_sql(name='Humid_Data', con=engine, if_exists='append', index=False)

C:\Users\Aaron\Anaconda3\lib\site-packages\pandas\io\sql.py:1144: UserWarning: The provided table name 'Humid_Data' is not found exactly as such in the database after writing the table, possibly due to case sensitivity issues. Consider using lower case table names.
  warnings.warn(msg, UserWarning)

## Confirm data is transferred - Humidity

In [ ]:
pd.read_sql_query('select * from Wine_Data', con=engine).head()

## Read in temperature CSV

In [9]:
csv_file = "../Raw_Data/state_temp.csv"
state_temp_df = pd.read_csv(csv_file)
state_temp_df.head()

        state  average_temp_farenheit  avg_temp_rank
0     Alabama                    62.8              7
1      Alaska                    26.6             50
2     Arizona                    60.3             10
3    Arkansas                    60.4              9
4  California                    59.4             12

## Use pandas to load csv DataFrame into database - Temperature

In [13]:
state_temp_df.to_sql(name='Temp_Data', con=engine, if_exists='append', index=False)

C:\Users\Aaron\Anaconda3\lib\site-packages\pandas\io\sql.py:1144: UserWarning: The provided table name 'Temp_Data' is not found exactly as such in the database after writing the table, possibly due to case sensitivity issues. Consider using lower case table names.
  warnings.warn(msg, UserWarning)

## Confirm data is transferred - Temperature

In [15]:
pd.read_sql_query('select * from Temp_Data', con=engine).head()

   id       state  average_temp_farenheit  avg_temp_rank
0   1     Alabama                    62.8              7
1   2      Alaska                    26.6             50
2   3     Arizona                    60.3             10
3   4    Arkansas                    60.4              9
4   5  California                    59.4             12

## Read in Rain CSV

In [17]:
csv_file = "../Raw_Data/state_rain.csv"
state_rain_df = pd.read_csv(csv_file)
state_rain_df.head()

        state  annual_inches  rain_rank
0     Alabama           58.3          4
1      Alaska           22.5         39
2     Arizona           13.6         47
3    Arkansas           50.6          8
4  California           22.2         40

## Use pandas to load csv DataFrame into database - Rain

In [18]:
state_rain_df.to_sql(name='Rain_Data', con=engine, if_exists='append', index=False)

C:\Users\Aaron\Anaconda3\lib\site-packages\pandas\io\sql.py:1144: UserWarning: The provided table name 'Rain_Data' is not found exactly as such in the database after writing the table, possibly due to case sensitivity issues. Consider using lower case table names.
  warnings.warn(msg, UserWarning)

## Confirm data is transferred - Rain

In [21]:
pd.read_sql_query('select * from Rain_Data', con=engine).head()

   id       state  annual_inches  rain_rank
0   1     Alabama           58.3          4
1   2      Alaska           22.5         39
2   3     Arizona           13.6         47
3   4    Arkansas           50.6          8
4   5  California           22.2         40